In [1]:
import pandas as pd

In [9]:
s1=pd.Series([100,200,300,400])
s1

0    100
1    200
2    300
3    400
dtype: int64

In [22]:
s1=pd.Series([100,200,300,400], index=("a","b","c","d"))
s1

a    100
b    200
c    300
d    400
dtype: int64

In [12]:
s1=pd.Series([100,200,300,400], index=("a","b","c","d"),name=("slaes of 4 days"))
s1

a    100
b    200
c    300
d    400
Name: slaes of 4 days, dtype: int64

In [13]:
s1.values

array([100, 200, 300, 400])

In [14]:
s1.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [15]:
s1.name

'slaes of 4 days'

## create a pandas series to store a canten data that how much sandwithes sales per day (in a week)

In [24]:
canten_sales=pd.Series([50,40,60,55,80,70,0],
                       index=["Mon","Tue","Wed","Thu","Fri","Sat","Sun"])
canten_sales.name="sales per week"
canten_sales

Mon    50
Tue    40
Wed    60
Thu    55
Fri    80
Sat    70
Sun     0
Name: sales per week, dtype: int64

In [25]:
canten_sales[3]

55

In [26]:
canten_sales["Mon"]

50

In [27]:
canten_sales[[2,4]]

Wed    60
Fri    80
Name: sales per week, dtype: int64

In [28]:
canten_sales[canten_sales>50]

Wed    60
Thu    55
Fri    80
Sat    70
Name: sales per week, dtype: int64

In [29]:
canten_sales[(canten_sales>40)&(canten_sales<60)]

Mon    50
Thu    55
Name: sales per week, dtype: int64

In [30]:
canten_sales[1:-1]

Tue    40
Wed    60
Thu    55
Fri    80
Sat    70
Name: sales per week, dtype: int64

In [31]:
canten_sales=canten_sales*2

In [32]:
canten_sales

Mon    100
Tue     80
Wed    120
Thu    110
Fri    160
Sat    140
Sun      0
Name: sales per week, dtype: int64

In [37]:
canten_sales=canten_sales/2

In [38]:
canten_sales

Mon    25.0
Tue    20.0
Wed    30.0
Thu    27.5
Fri    40.0
Sat    35.0
Sun     0.0
Name: sales per week, dtype: float64

In [39]:
adic={501:"Hamza",502:"Abbas",503:"Nouman",504:"Safdar",505:"Kashan"}

In [40]:
ss=pd.Series(adic)

In [41]:
ss.values

array(['Hamza', 'Abbas', 'Nouman', 'Safdar', 'Kashan'], dtype=object)

In [42]:
ss.index

Int64Index([501, 502, 503, 504, 505], dtype='int64')

In [44]:
sa=pd.Series(adic,index=[504,503,505,501,502])

In [45]:
sa

504    Safdar
503    Nouman
505    Kashan
501     Hamza
502     Abbas
dtype: object

In [49]:
ss.name="students Series"

In [50]:
ss.name

'students Series'

In [51]:
sa=pd.Series(adic,index=[504,503,505,501,502,507])

In [53]:
sa.isnull()

504    False
503    False
505    False
501    False
502    False
507     True
dtype: bool

In [54]:
pd.isnull(sa)           #we can use both methods

504    False
503    False
505    False
501    False
502    False
507     True
dtype: bool

## Can we change index names??

In [55]:
canten_sales=pd.Series([50,40,60,55,80,70,0],
                       index=["Mon","Tue","Wed","Thu","Fri","Sat","Sun"])
canten_sales.name="sales per week"
canten_sales

Mon    50
Tue    40
Wed    60
Thu    55
Fri    80
Sat    70
Sun     0
Name: sales per week, dtype: int64

In [56]:
canten_sales.index

Index(['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun'], dtype='object')

In [60]:
canten_sales.index=["m","t","w","t","f","s","s"]

In [61]:
canten_sales.index

Index(['m', 't', 'w', 't', 'f', 's', 's'], dtype='object')

In [63]:
canten_sales["t"]

t    40
t    55
Name: sales per week, dtype: int64

so yes we can change index names
if there are multiple values with same name of index it will extract all

In [64]:
canten_sales.index.name

In [65]:
canten_sales.index.name="sales index"

In [66]:
canten_sales.index.name

'sales index'

In [67]:
canten_sales

sales index
m    50
t    40
w    60
t    55
f    80
s    70
s     0
Name: sales per week, dtype: int64

#  DataFrames

In [68]:
import pandas as pd

In [69]:
apples=pd.Series([0,1,2,3])
oranges=pd.Series([1,2,3,4])
data={"apples":apples,"oranges":oranges}
fruit_df=pd.DataFrame(data)

In [70]:
fruit_df

   apples  oranges
0       0        1
1       1        2
2       2        3
3       3        4

In [2]:
import numpy as np

In [10]:
a=np.arange(100).reshape(10,10)
print(type(a))
s1=pd.Series([a])
print(type(s1))

<class 'numpy.ndarray'>
<class 'pandas.core.series.Series'>

In [11]:
df1=pd.DataFrame(a)

In [12]:
df1

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [13]:
type(df1)

pandas.core.frame.DataFrame

In [14]:
column_names=[chr(i) for i in range(65,75)]
column_names

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']

In [15]:
rows_names=[chr(i) for i in range(97,107)]
rows_names

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [16]:
df1.columns=column_names
df1.index=rows_names

In [17]:
df1

    A   B   C   D   E   F   G   H   I   J
a   0   1   2   3   4   5   6   7   8   9
b  10  11  12  13  14  15  16  17  18  19
c  20  21  22  23  24  25  26  27  28  29
d  30  31  32  33  34  35  36  37  38  39
e  40  41  42  43  44  45  46  47  48  49
f  50  51  52  53  54  55  56  57  58  59
g  60  61  62  63  64  65  66  67  68  69
h  70  71  72  73  74  75  76  77  78  79
i  80  81  82  83  84  85  86  87  88  89
j  90  91  92  93  94  95  96  97  98  99

In [18]:
df1.H

a     7
b    17
c    27
d    37
e    47
f    57
g    67
h    77
i    87
j    97
Name: H, dtype: int64

In [19]:
df1.D=5

In [20]:
df1

    A   B   C  D   E   F   G   H   I   J
a   0   1   2  5   4   5   6   7   8   9
b  10  11  12  5  14  15  16  17  18  19
c  20  21  22  5  24  25  26  27  28  29
d  30  31  32  5  34  35  36  37  38  39
e  40  41  42  5  44  45  46  47  48  49
f  50  51  52  5  54  55  56  57  58  59
g  60  61  62  5  64  65  66  67  68  69
h  70  71  72  5  74  75  76  77  78  79
i  80  81  82  5  84  85  86  87  88  89
j  90  91  92  5  94  95  96  97  98  99

In [21]:
df1.O=4

In [22]:
df1

    A   B   C  D   E   F   G   H   I   J
a   0   1   2  5   4   5   6   7   8   9
b  10  11  12  5  14  15  16  17  18  19
c  20  21  22  5  24  25  26  27  28  29
d  30  31  32  5  34  35  36  37  38  39
e  40  41  42  5  44  45  46  47  48  49
f  50  51  52  5  54  55  56  57  58  59
g  60  61  62  5  64  65  66  67  68  69
h  70  71  72  5  74  75  76  77  78  79
i  80  81  82  5  84  85  86  87  88  89
j  90  91  92  5  94  95  96  97  98  99

In [23]:
df1["O"]=2

In [24]:
df1

    A   B   C  D   E   F   G   H   I   J  O
a   0   1   2  5   4   5   6   7   8   9  2
b  10  11  12  5  14  15  16  17  18  19  2
c  20  21  22  5  24  25  26  27  28  29  2
d  30  31  32  5  34  35  36  37  38  39  2
e  40  41  42  5  44  45  46  47  48  49  2
f  50  51  52  5  54  55  56  57  58  59  2
g  60  61  62  5  64  65  66  67  68  69  2
h  70  71  72  5  74  75  76  77  78  79  2
i  80  81  82  5  84  85  86  87  88  89  2
j  90  91  92  5  94  95  96  97  98  99  2

In [28]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)

In [29]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [36]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [37]:
obj4=pd.Series(sdata,index=states)

In [38]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [40]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [41]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [42]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [43]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [45]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [46]:
obj4.name = 'population'

In [47]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [48]:
obj4.index.name="States"

In [49]:
obj4

States
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [50]:
df1

    A   B   C  D   E   F   G   H   I   J  O
a   0   1   2  5   4   5   6   7   8   9  2
b  10  11  12  5  14  15  16  17  18  19  2
c  20  21  22  5  24  25  26  27  28  29  2
d  30  31  32  5  34  35  36  37  38  39  2
e  40  41  42  5  44  45  46  47  48  49  2
f  50  51  52  5  54  55  56  57  58  59  2
g  60  61  62  5  64  65  66  67  68  69  2
h  70  71  72  5  74  75  76  77  78  79  2
i  80  81  82  5  84  85  86  87  88  89  2
j  90  91  92  5  94  95  96  97  98  99  2

In [51]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       10 non-null     int64
 1   B       10 non-null     int64
 2   C       10 non-null     int64
 3   D       10 non-null     int64
 4   E       10 non-null     int64
 5   F       10 non-null     int64
 6   G       10 non-null     int64
 7   H       10 non-null     int64
 8   I       10 non-null     int64
 9   J       10 non-null     int64
 10  O       10 non-null     int64
dtypes: int64(11)
memory usage: 1.2+ KB

In [78]:
 df=pd.read_csv("/home/sajid/Desktop/Quarter_2/Sir Qasim git repo/Sunday/1_30 to 3_30/data/train.csv")

In [79]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [81]:
df.PassengerId.notnull().all()

True

In [82]:
df.PassengerId.isnull().any()

False

In [83]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [84]:
df.Age.value_counts().head()

24.0    30
22.0    27
18.0    26
19.0    25
30.0    25
Name: Age, dtype: int64

In [85]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [86]:
df["Age"].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [87]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [75]:
# df.columns=[chr(i) for i in range(65,77)]

In [77]:
df.head()

,A,B,C,D,E,F,G,H,I,J,K,L
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Map

In [118]:
def abc(x):
    if x==0:
        return "Not survived"
    else:
        return "Survived"

In [113]:
df["dispatch"]=df.Survived.apply(abc)

In [114]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,dispatch
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Not survived
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Survived
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Survived
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Survived
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Not survived

In [115]:
dd={0:"Not survived",
   1:"Survived"}

In [116]:
df["lavel"]=df.Survived.map(dd)

In [117]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,dispatch,lavel
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Not survived,Not survived
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Survived,Survived
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Survived,Survived
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Survived,Survived
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Not survived,Not survived
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Not survived,Not survived
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Survived,Survived
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Not survived,Not survived
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Survived,Survived
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Not survived,Not survived

In [1]:
import pandas as pd
import numpy as np

In [27]:
data={"Name":["Ali","ahmad","hamza","Umar"],
      "AIFEV":[90,84,74,89],
      "Git":[44,77,94,69],
      "python":[77,82,93,65],
      "Numpy":[30,50,70,90]}

In [28]:
data=pd.DataFrame(data)
data

    Name  AIFEV  Git  python  Numpy
0    Ali     90   44      77     30
1  ahmad     84   77      82     50
2  hamza     74   94      93     70
3   Umar     89   69      65     90

In [29]:
data["Total"]=data["AIFEV"]+data["Git"]+data["python"]+data["Numpy"]

In [30]:
data

    Name  AIFEV  Git  python  Numpy  Total
0    Ali     90   44      77     30    241
1  ahmad     84   77      82     50    293
2  hamza     74   94      93     70    331
3   Umar     89   69      65     90    313

In [31]:
data["Percentage"]=data["Total"]/400*100

In [32]:
data

    Name  AIFEV  Git  python  Numpy  Total  Percentage
0    Ali     90   44      77     30    241       60.25
1  ahmad     84   77      82     50    293       73.25
2  hamza     74   94      93     70    331       82.75
3   Umar     89   69      65     90    313       78.25

In [33]:
def grades(x):
    if x>90: return "A"
    elif x>80: return "B"
    elif x>70: return "C"
    elif x> 60: return "D"
    else: return "Fail"

In [34]:
grades(80)

'C'

In [35]:
def pas(x):
    if x> 60: return "pass"
    else : return "Fail"

In [39]:
data["grades"]=data.Percentage.apply(grades)

In [40]:
data

    Name  AIFEV  Git  python  Numpy  Total  Percentage grades
0    Ali     90   44      77     30    241       60.25      D
1  ahmad     84   77      82     50    293       73.25      C
2  hamza     74   94      93     70    331       82.75      B
3   Umar     89   69      65     90    313       78.25      C

In [23]:
x=[2,3,4,5]
print(*x)

2 3 4 5

In [41]:
data["Result"]=data.Percentage.apply(pas)

In [42]:
data

    Name  AIFEV  Git  python  Numpy  Total  Percentage grades Result
0    Ali     90   44      77     30    241       60.25      D   pass
1  ahmad     84   77      82     50    293       73.25      C   pass
2  hamza     74   94      93     70    331       82.75      B   pass
3   Umar     89   69      65     90    313       78.25      C   pass

In [45]:
data.index=["1st","2nd","3rd","4th"]

In [48]:
data["Numpy"]

1st    30
2nd    50
3rd    70
4th    90
Name: Numpy, dtype: int64

In [ ]:
def subject(AIFEV,Git,python,Numpy):

In [66]:
def sp(x1,x2,x3,x4):
    if x1 and x2 and x3 and x4 >60: return "Pass"
    else : return "Fail"

In [67]:
data

      Name  AIFEV  Git  python  Numpy  Total  Percentage grades Result
1st    Ali     90   44      77     30    241       60.25      D   Fail
2nd  ahmad     84   77      82     50    293       73.25      C   Fail
3rd  hamza     74   94      93     70    331       82.75      B   Pass
4th   Umar     89   69      65     90    313       78.25      C   Pass

In [73]:
aa=data.take([0])

In [76]:
aa

    Name  AIFEV  Git  python  Numpy  Total  Percentage grades Result
1st  Ali     90   44      77     30    241       60.25      D   Fail

In [77]:
aa["Git"]=0

In [78]:
aa

    Name  AIFEV  Git  python  Numpy  Total  Percentage grades Result
1st  Ali     90    0      77     30    241       60.25      D   Fail

In [79]:
data

      Name  AIFEV  Git  python  Numpy  Total  Percentage grades Result
1st    Ali     90   44      77     30    241       60.25      D   Fail
2nd  ahmad     84   77      82     50    293       73.25      C   Fail
3rd  hamza     74   94      93     70    331       82.75      B   Pass
4th   Umar     89   69      65     90    313       78.25      C   Pass

In [85]:
data["Result"]=data[["AIFEV","Git","python","Numpy"]].apply(lambda x:sp(*x), axis=1)

In [ ]:
data

In [62]:
data.Total.sum()

1178

In [92]:
data["extra"]=data[["Total","Numpy","Git","python"]].apply(lambda x:sp(*x),axis=1)

In [94]:
data    #check it later

      Name  AIFEV  Git  python  Numpy  Total  Percentage grades Result extra
1st    Ali     90   44      77     30    241       60.25      D   Fail  Pass
2nd  ahmad     84   77      82     50    293       73.25      C   Fail  Pass
3rd  hamza     74   94      93     70    331       82.75      B   Pass  Pass
4th   Umar     89   69      65     90    313       78.25      C   Pass  Pass

In [22]:
s1=pd.Series(np.arange(10))
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [24]:
s1[1]

1

In [25]:
s1.loc[1]

1

In [26]:
s1.iloc[2]

2

In [32]:
s1.iloc[[-1]]

9    9
dtype: int64

In [33]:
s5 = pd.Series([1, 2, 3], index=[10, 11, 12])
s5

10    1
11    2
12    3
dtype: int64

In [34]:
s5[11]

2

In [35]:
s5.loc[12]

3

In [36]:
s5.iloc[1]

2

In [37]:
# multiple items by label (loc)
s5.loc[[12, 10]]

12    3
10    1
dtype: int64

In [38]:
# multiple items by location / position (iloc)
s5.iloc[[0, 2]]

10    1
12    3
dtype: int64

In [41]:
# -1 and 15 will be NaN
s5.loc[[12, -1, 15]]

KeyError: "Passing list-likes to .loc or [] with any missing labels is no longer supported. The following labels were missing: Int64Index([-1, 15], dtype='int64'). See https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike"

In [43]:
s3 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
s3

a    1
b    2
c    3
dtype: int64

In [45]:
# label based lookup
s3.ix[['a', 'c']]

AttributeError: 'Series' object has no attribute 'ix'

In [46]:
s3*2

a    2
b    4
c    6
dtype: int64

In [47]:
s4=pd.Series(2,index=s3.index)
s4

a    2
b    2
c    2
dtype: int64

In [48]:
s3*s4

a    2
b    4
c    6
dtype: int64

In [49]:
s = pd.Series(np.arange(0, 10))
s > 5

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
8     True
9     True
dtype: bool

In [50]:
s[s>5]

6    6
7    7
8    8
9    9
dtype: int64

In [52]:
s[(s > 5) & (s < 8)]

6    6
7    7
dtype: int64

In [53]:
s1=pd.Series(["red","blue","green"],index=[2,5,7])
s1

2      red
5     blue
7    green
dtype: object

In [55]:
s2=s1.reindex(np.arange(10))
s2

0      NaN
1      NaN
2      red
3      NaN
4      NaN
5     blue
6      NaN
7    green
8      NaN
9      NaN
dtype: object

In [56]:
s1

2      red
5     blue
7    green
dtype: object

In [58]:
s3=s1.reindex(np.arange(10),method="ffill")
s3

0      NaN
1      NaN
2      red
3      red
4      red
5     blue
6     blue
7    green
8    green
9    green
dtype: object

In [59]:
s3=s1.reindex(np.arange(10),method="bfill")
s3

0      red
1      red
2      red
3     blue
4     blue
5     blue
6    green
7    green
8      NaN
9      NaN
dtype: object

In [61]:
s3=s1.reindex(np.arange(10),method="nearest")
s3

0      red
1      red
2      red
3      red
4     blue
5     blue
6    green
7    green
8    green
9    green
dtype: object

In [62]:
del(s3[5])

In [63]:
s3

0      red
1      red
2      red
3      red
4     blue
6    green
7    green
8    green
9    green
dtype: object

In [95]:
a=np.array([1,2,3,4])
b=np.array([5,6,7,8])
s1=pd.Series(a,b)
s1

5    1
6    2
7    3
8    4
dtype: int64

In [96]:
s1.values

array([1, 2, 3, 4])

In [97]:
s1.index

Int64Index([5, 6, 7, 8], dtype='int64')

In [98]:
s2=pd.Series(a+b)

In [99]:
s2

0     6
1     8
2    10
3    12
dtype: int64

In [100]:
aa=pd.Series([1,2,3,4],index=["a","b","c","d"])
bb=pd.Series([5,6,7,8],index=["e","b","c","f"])
s3=pd.Series(aa+bb)
s3

a     NaN
b     8.0
c    10.0
d     NaN
e     NaN
f     NaN
dtype: float64

In [104]:
s4=pd.Series(s3,index=["b","d"])
s4

b    8.0
d    NaN
dtype: float64

In [105]:
s5=s3.reindex(["b","a","c","f"])
s5

b     8.0
a     NaN
c    10.0
f     NaN
dtype: float64

In [106]:
pd.isnull(s5)

b    False
a     True
c    False
f     True
dtype: bool

In [107]:
pd.notnull(s5)

b     True
a    False
c     True
f    False
dtype: bool

In [108]:
pd.notna(s5)

b     True
a    False
c     True
f    False
dtype: bool

In [110]:
# if any value in np array is nan the mean will be nan
nparr=np.array([1,2,3,4,5,np.NaN])
np.mean(nparr)

nan

In [114]:
# pandas did not return mean as nan
pdseries=pd.Series(nparr)
print(pdseries)
np.mean(pdseries)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
dtype: float64

3.0

In [115]:
# hence prove that mean of pandas series with nan value will not be nan

## addition with two similar indexes

In [116]:
s1=pd.Series([1,2,3],index=["a","a","b"])
s2=pd.Series([4,5,6],index=["a","a","c"])
s1+s2

a    5.0
a    6.0
a    6.0
a    7.0
b    NaN
c    NaN
dtype: float64

In [127]:
s1=pd.Series([1,2,3,4,5,6],index=[0,2,1,4,5,6])
s1

0    1
2    2
1    3
4    4
5    5
6    6
dtype: int64

In [129]:
s1[1]  #if u try to get with location based index or label based even return label based

3

In [132]:
s1[3]  # it will give error because label index 3 is not exist

KeyError: 3

In [134]:
s1.loc[3]  #loc work same as nothing mention

KeyError: 3

In [136]:
s1.iloc[3]   #iloc return position based index not label based

4

In [7]:
s1=pd.Series(["red","blue","green"],index=[3,5,7])
s1

3      red
5     blue
7    green
dtype: object

In [8]:
s2=s1.reindex(np.arange(10))

In [9]:
s2

0      NaN
1      NaN
2      NaN
3      red
4      NaN
5     blue
6      NaN
7    green
8      NaN
9      NaN
dtype: object

In [10]:
s3=s1.reindex(np.arange(10),method="bfill")
s3

0      red
1      red
2      red
3      red
4     blue
5     blue
6    green
7    green
8      NaN
9      NaN
dtype: object

In [11]:
s4=s1.reindex(np.arange(10),method="ffill")
s4

0      NaN
1      NaN
2      NaN
3      red
4      red
5     blue
6     blue
7    green
8    green
9    green
dtype: object

In [12]:
 s5=s1.reindex(np.arange(10),method="nearest")
s5

0      red
1      red
2      red
3      red
4     blue
5     blue
6    green
7    green
8    green
9    green
dtype: object

In [16]:
df1=pd.DataFrame(np.arange(20),index=[chr(i) for i in range(65,85)])
df1

    0
A   0
B   1
C   2
D   3
E   4
F   5
G   6
H   7
I   8
J   9
K  10
L  11
M  12
N  13
O  14
P  15
Q  16
R  17
S  18
T  19

In [17]:
df1[1:10]

   0
B  1
C  2
D  3
E  4
F  5
G  6
H  7
I  8
J  9

In [19]:
df1["A":"O"]

    0
A   0
B   1
C   2
D   3
E   4
F   5
G   6
H   7
I   8
J   9
K  10
L  11
M  12
N  13
O  14

In [20]:
df1.loc["B":"G"]

   0
B  1
C  2
D  3
E  4
F  5
G  6

In [21]:
df1.iloc[3:6]

   0
D  3
E  4
F  5

In [68]:
s1=pd.Series([2,3,4,6],[2,3,4,4,])
s1

2    2
3    3
4    4
4    6
dtype: int64

In [82]:
s1=pd.Series([np.array([[2,3,4,5],[6,7,8,9]])])
type(s1.values)
type(s1)

pandas.core.series.Series

In [85]:
df1=pd.DataFrame(s1)
df1

                              0
0  [[2, 3, 4, 5], [6, 7, 8, 9]]

In [103]:
s1=pd.Series([0,1,2,3,4])
s2=pd.Series([5,6,7,8,9])
df1=pd.DataFrame((s1,s2),
                 index=["A","B"],
#                 columns=["a","b","c","d","e"]
                )

In [104]:
df1

   0  1  2  3  4
A  0  1  2  3  4
B  5  6  7  8  9

In [111]:
df2=pd.DataFrame({"boys":s1,"girls":s2})

In [112]:
df2

   boys  girls
0     0      5
1     1      6
2     2      7
3     3      8
4     4      9

In [113]:
df2.columns=["A","B"]

In [114]:
df2

   A  B
0  0  5
1  1  6
2  2  7
3  3  8
4  4  9

In [101]:
df1.describe()

              0         1         2         3         4
count  2.000000  2.000000  2.000000  2.000000  2.000000
mean   2.500000  3.500000  4.500000  5.500000  6.500000
std    3.535534  3.535534  3.535534  3.535534  3.535534
min    0.000000  1.000000  2.000000  3.000000  4.000000
25%    1.250000  2.250000  3.250000  4.250000  5.250000
50%    2.500000  3.500000  4.500000  5.500000  6.500000
75%    3.750000  4.750000  5.750000  6.750000  7.750000
max    5.000000  6.000000  7.000000  8.000000  9.000000

In [102]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, A to B
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
dtypes: int64(5)
memory usage: 96.0+ bytes

## DataFrame Object

In [115]:
pd.DataFrame(np.array([[10, 11], [20, 21]]))

    0   1
0  10  11
1  20  21

In [118]:
# create a DataFrame for a list of Series objects
df1 = pd.DataFrame([pd.Series(np.arange(10, 15)),
                    pd.Series(np.arange(15, 20))])
df1

    0   1   2   3   4
0  10  11  12  13  14
1  15  16  17  18  19

In [122]:
df1.shape

(2, 5)

In [129]:
df1.shift(axis=1,fill_value=1)

   0   1   2   3   4
0  1  10  11  12  13
1  1  15  16  17  18

In [142]:
df1=pd.DataFrame(np.array([[10,11],[12,13]]),index=["a","b"],columns=["A","B"])
df1

    A   B
a  10  11
b  12  13

In [146]:
# specify column names
df = pd.DataFrame(np.array([[10, 11], [20, 21]]),
                  columns=['a', 'b'])
df

    a   b
0  10  11
1  20  21

In [147]:
df.columns

Index(['a', 'b'], dtype='object')

In [148]:
df.columns[0]

'a'

In [149]:
df.columns[1]

'b'

In [151]:
 df

    a   b
0  10  11
1  20  21

In [152]:
# rename the column
df.columns=["c","d"]

In [153]:
df

    c   d
0  10  11
1  20  21

In [156]:
# create a DataFrame with named columns and rows
df=pd.DataFrame([[11,12],[13,14]],
               index=["a","b"],
               columns=["A","B"])
df

    A   B
a  11  12
b  13  14

In [157]:
df.index

Index(['a', 'b'], dtype='object')

In [158]:
df.columns

Index(['A', 'B'], dtype='object')

In [162]:
# create a dataframe with two series
s1=pd.Series(np.arange(1,6))
s2=pd.Series(np.arange(6,11))
df=pd.DataFrame({"c1":s1,
                "c2":s2})
df

   c1  c2
0   1   6
1   2   7
2   3   8
3   4   9
4   5  10

In [164]:
 df.index=[11,12,13,14,15]
df

    c1  c2
11   1   6
12   2   7
13   3   8
14   4   9
15   5  10

In [165]:
df.columns=["A","B"]
df

    A   B
11  1   6
12  2   7
13  3   8
14  4   9
15  5  10

In [168]:
s1=pd.Series(np.arange(1,6))
s2=pd.Series(np.arange(6,11))
df=pd.DataFrame({"c1":s1,
                "c2":s2})
df

   c1  c2
0   1   6
1   2   7
2   3   8
3   4   9
4   5  10

In [175]:
s3=pd.Series(np.array((11,12)),index=[1,3])
df=pd.DataFrame({"c1":s1,"c2":s2,"c3":s3})
df

   c1  c2    c3
0   1   6   NaN
1   2   7  11.0
2   3   8   NaN
3   4   9  12.0
4   5  10   NaN

In [174]:
s3=pd.Series(np.array((11,12)),index=[11,13])
df=pd.DataFrame({"A":s1,"B":s2,"C":s3})
df

      A     B     C
0   1.0   6.0   NaN
1   2.0   7.0   NaN
2   3.0   8.0   NaN
3   4.0   9.0   NaN
4   5.0  10.0   NaN
11  NaN   NaN  11.0
13  NaN   NaN  12.0

In [289]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year':  [2000, 2001, 2002, 2001, 2002, 2003],
        'pop':   [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [291]:
frame.index=[chr(i) for i in range(65,71)]

In [292]:
frame

    state  year  pop
A    Ohio  2000  1.5
B    Ohio  2001  1.7
C    Ohio  2002  3.6
D  Nevada  2001  2.4
E  Nevada  2002  2.9
F  Nevada  2003  3.2

In [245]:
frame2=pd.DataFrame(frame,columns=["year","state","pop"])
frame2

   year   state  pop
A  2000    Ohio  1.5
B  2001    Ohio  1.7
C  2002    Ohio  3.6
D  2001  Nevada  2.4
E  2002  Nevada  2.9
F  2003  Nevada  3.2

In [190]:
frame3=pd.DataFrame(data,columns=["year","state","pop","debt"],index=[np.arange(1,7)])
frame3

   year   state  pop debt
1  2000    Ohio  1.5  NaN
2  2001    Ohio  1.7  NaN
3  2002    Ohio  3.6  NaN
4  2001  Nevada  2.4  NaN
5  2002  Nevada  2.9  NaN
6  2003  Nevada  3.2  NaN

In [203]:
frame4=pd.DataFrame(frame3,columns=["year","state","pop","debt"],index=[np.arange(6,0,-1)])
frame4

   year   state  pop debt
6  2003  Nevada  3.2  NaN
5  2002  Nevada  2.9  NaN
4  2001  Nevada  2.4  NaN
3  2002    Ohio  3.6  NaN
2  2001    Ohio  1.7  NaN
1  2000    Ohio  1.5  NaN

In [246]:
frame2["debt"]=0
frame2

   year   state  pop  debt
A  2000    Ohio  1.5     0
B  2001    Ohio  1.7     0
C  2002    Ohio  3.6     0
D  2001  Nevada  2.4     0
E  2002  Nevada  2.9     0
F  2003  Nevada  3.2     0

In [247]:
frame2["debt"]=100
frame2

   year   state  pop  debt
A  2000    Ohio  1.5   100
B  2001    Ohio  1.7   100
C  2002    Ohio  3.6   100
D  2001  Nevada  2.4   100
E  2002  Nevada  2.9   100
F  2003  Nevada  3.2   100

In [248]:
frame2.debt=np.arange(1,7)
frame2

   year   state  pop  debt
A  2000    Ohio  1.5     1
B  2001    Ohio  1.7     2
C  2002    Ohio  3.6     3
D  2001  Nevada  2.4     4
E  2002  Nevada  2.9     5
F  2003  Nevada  3.2     6

In [224]:
frame2

   year   state  pop  debt
A  2000    Ohio  1.5   100
B  2001    Ohio  1.7   100
C  2002    Ohio  3.6   100
D  2001  Nevada  2.4   100
E  2002  Nevada  2.9   100
F  2003  Nevada  3.2   100

In [249]:
val=pd.Series([1.2,1.7,4],index=["A","D","F"])

In [250]:
frame2["debt"]=val

In [251]:
frame2

   year   state  pop  debt
A  2000    Ohio  1.5   1.2
B  2001    Ohio  1.7   NaN
C  2002    Ohio  3.6   NaN
D  2001  Nevada  2.4   1.7
E  2002  Nevada  2.9   NaN
F  2003  Nevada  3.2   4.0

In [231]:
frame2.year

A    2000
B    2001
C    2002
D    2001
E    2002
F    2003
Name: year, dtype: int64

In [252]:
frame2=pd.DataFrame(frame2,index=[chr(i) for i in range(70,64,-1)])

In [253]:
frame2

   year   state  pop  debt
F  2003  Nevada  3.2   4.0
E  2002  Nevada  2.9   NaN
D  2001  Nevada  2.4   1.7
C  2002    Ohio  3.6   NaN
B  2001    Ohio  1.7   NaN
A  2000    Ohio  1.5   1.2

In [254]:
frame2=pd.DataFrame(frame2,index=[chr(i) for i in range(65,71)])

In [255]:
frame2

   year   state  pop  debt
A  2000    Ohio  1.5   1.2
B  2001    Ohio  1.7   NaN
C  2002    Ohio  3.6   NaN
D  2001  Nevada  2.4   1.7
E  2002  Nevada  2.9   NaN
F  2003  Nevada  3.2   4.0

In [256]:
frame2.index=np.arange(1,7)
frame2

   year   state  pop  debt
1  2000    Ohio  1.5   1.2
2  2001    Ohio  1.7   NaN
3  2002    Ohio  3.6   NaN
4  2001  Nevada  2.4   1.7
5  2002  Nevada  2.9   NaN
6  2003  Nevada  3.2   4.0

In [258]:
frame2["eastern"]=frame2.state
frame2

   year   state  pop  debt eastern
1  2000    Ohio  1.5   1.2    Ohio
2  2001    Ohio  1.7   NaN    Ohio
3  2002    Ohio  3.6   NaN    Ohio
4  2001  Nevada  2.4   1.7  Nevada
5  2002  Nevada  2.9   NaN  Nevada
6  2003  Nevada  3.2   4.0  Nevada

In [269]:
frame3["eastern"]=frame3.state
frame3

   year   state  pop  debt eastern
1  2000    Ohio  1.5   NaN    Ohio
2  2001    Ohio  1.7   NaN    Ohio
3  2002    Ohio  3.6   NaN    Ohio
4  2001  Nevada  2.4   NaN  Nevada
5  2002  Nevada  2.9   NaN  Nevada
6  2003  Nevada  3.2   NaN  Nevada

In [267]:
frame2["greater_then_2"]=frame2["pop"]>2
frame2

   year   state  pop  debt eastern  greater_then_2
1  2000    Ohio  1.5   1.2    Ohio           False
2  2001    Ohio  1.7   NaN    Ohio           False
3  2002    Ohio  3.6   NaN    Ohio            True
4  2001  Nevada  2.4   1.7  Nevada            True
5  2002  Nevada  2.9   NaN  Nevada            True
6  2003  Nevada  3.2   4.0  Nevada            True

In [271]:
del frame2["eastern"]
frame2

   year   state  pop  debt  greater_then_2
1  2000    Ohio  1.5   1.2           False
2  2001    Ohio  1.7   NaN           False
3  2002    Ohio  3.6   NaN            True
4  2001  Nevada  2.4   1.7            True
5  2002  Nevada  2.9   NaN            True
6  2003  Nevada  3.2   4.0            True

In [276]:
data={"ab":{2001:"xx",2002:"yy",2003:"zz"},
     "cd":{2001:"zz",2003:"ww"}}

In [277]:
df=pd.DataFrame(data)
df

      ab   cd
2001  xx   zz
2002  yy  NaN
2003  zz   ww

In [278]:
df.columns

Index(['ab', 'cd'], dtype='object')

In [279]:
df.index

Int64Index([2001, 2002, 2003], dtype='int64')

In [280]:
df.T

   2001 2002 2003
ab   xx   yy   zz
cd   zz  NaN   ww

In [282]:
df.T.columns

Int64Index([2001, 2002, 2003], dtype='int64')

In [288]:
frame

    state    year  pop
F  Nevada  2003.0  3.2
A    Ohio  2000.0  1.5
D     NaN     NaN  NaN
C     NaN     NaN  NaN
B     NaN     NaN  NaN
E     NaN     NaN  NaN

In [286]:
frame=frame.reindex(["F","A","D","C","B","E"])

In [287]:
frame

    state    year  pop
F  Nevada  2003.0  3.2
A    Ohio  2000.0  1.5
D     NaN     NaN  NaN
C     NaN     NaN  NaN
B     NaN     NaN  NaN
E     NaN     NaN  NaN

In [293]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year':  [2000, 2001, 2002, 2001, 2002, 2003],
        'pop':   [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [294]:
frame11=frame.reindex([4,5,3,2,0,1,7])
frame11

    state    year  pop
4  Nevada  2002.0  2.9
5  Nevada  2003.0  3.2
3  Nevada  2001.0  2.4
2    Ohio  2002.0  3.6
0    Ohio  2000.0  1.5
1    Ohio  2001.0  1.7
7     NaN     NaN  NaN

In [300]:
frame12=frame.reindex(columns=["year","pop","state"])
frame12

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [306]:
droped_frame11=frame11.drop([3])
droped_frame11

    state    year  pop
4  Nevada  2002.0  2.9
5  Nevada  2003.0  3.2
2    Ohio  2002.0  3.6
0    Ohio  2000.0  1.5
1    Ohio  2001.0  1.7
7     NaN     NaN  NaN

In [308]:
droped_frame11=frame11.drop([3,4,2])
droped_frame11

    state    year  pop
5  Nevada  2003.0  3.2
0    Ohio  2000.0  1.5
1    Ohio  2001.0  1.7
7     NaN     NaN  NaN

In [310]:
 droped_frame12=frame11.drop([1:4])  #drop can't support slicing
droped_frame12

SyntaxError: invalid syntax (<ipython-input-310-45af6e6c6ad3>, line 1)

In [311]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [313]:
droped=frame.drop(["pop"],axis=1)

In [314]:
droped

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5  Nevada  2003

## DateRange

In [315]:
date_index=pd.date_range("1/1/2020",periods=6,freq="D")
date_index

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06'],
              dtype='datetime64[ns]', freq='D')

In [317]:
df=pd.DataFrame({"price":[120,110,90,70,110,100]},index=date_index) 
df

            price
2020-01-01    120
2020-01-02    110
2020-01-03     90
2020-01-04     70
2020-01-05    110
2020-01-06    100

In [323]:
date_index2=pd.date_range("29/12/2019",periods=10,freq="D")

In [324]:
df.reindex(date_index2)

            price
2019-12-29    NaN
2019-12-30    NaN
2019-12-31    NaN
2020-01-01  120.0
2020-01-02  110.0
2020-01-03   90.0
2020-01-04   70.0
2020-01-05  110.0
2020-01-06  100.0
2020-01-07    NaN

In [326]:
df.reindex(date_index2,method="bfill")

            price
2019-12-29  120.0
2019-12-30  120.0
2019-12-31  120.0
2020-01-01  120.0
2020-01-02  110.0
2020-01-03   90.0
2020-01-04   70.0
2020-01-05  110.0
2020-01-06  100.0
2020-01-07    NaN

In [327]:
# indexing slicing

In [368]:
df=pd.DataFrame(np.arange(10*5).reshape(10,5),index=[chr(i) for i in range(65,75)])
df

    0   1   2   3   4
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14
D  15  16  17  18  19
E  20  21  22  23  24
F  25  26  27  28  29
G  30  31  32  33  34
H  35  36  37  38  39
I  40  41  42  43  44
J  45  46  47  48  49

In [373]:
df.columns=[chr(i) for i in range(97,102)]

In [374]:
df.columns

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [347]:
df.loc["A":"E",:2]

    0   1   2
A   0   1   2
B   5   6   7
C  10  11  12
D  15  16  17
E  20  21  22

In [348]:
df[:2]

   0  1  2  3  4
A  0  1  2  3  4
B  5  6  7  8  9

In [346]:
df["A":"E",:2]

KeyError: (slice('A', 'E', None), slice(None, 2, None))

In [341]:
df["A":"E"]  # it is also returning rows

    0   1   2   3   4
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14
D  15  16  17  18  19
E  20  21  22  23  24

In [342]:
df[:2]   # it simply returns rows

   0  1  2  3  4
A  0  1  2  3  4
B  5  6  7  8  9

In [333]:
df[1]  #columns can be get directly in this stage

A     1
B     6
C    11
D    16
E    21
F    26
G    31
H    36
I    41
J    46
Name: 1, dtype: int64

In [331]:
 df["B"]

KeyError: 'B'

In [354]:
 df

    a   b   c   d   e
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14
D  15  16  17  18  19
E  20  21  22  23  24
F  25  26  27  28  29
G  30  31  32  33  34
H  35  36  37  38  39
I  40  41  42  43  44
J  45  46  47  48  49

In [363]:
df.loc[["A","E"]]

    a   b   c   d   e
A   0   1   2   3   4
E  20  21  22  23  24

In [361]:
df[["a","e"]]

    a   e
A   0   4
B   5   9
C  10  14
D  15  19
E  20  24
F  25  29
G  30  34
H  35  39
I  40  44
J  45  49

In [360]:
df["a"]

A     0
B     5
C    10
D    15
E    20
F    25
G    30
H    35
I    40
J    45
Name: a, dtype: int64

In [357]:
df.loc["A":"E","a":"e"]

    a   b   c   d   e
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14
D  15  16  17  18  19
E  20  21  22  23  24

# conclusion

To avoid from errors use loc for label index and iloc for position based index

# rdiv
the given value will be divided with every element of the dataframe
rdiv divide every element of the dataframe with given value

In [369]:
df1=pd.DataFrame({"A":[1,2,3,4]})
df1.rdiv(2) #2/1 ,2/2 , 2/3 , 2,4

          A
0  2.000000
1  1.000000
2  0.666667
3  0.500000

In [370]:
df.rdiv(2)

          0         1         2         3         4
A       inf  2.000000  1.000000  0.666667  0.500000
B  0.400000  0.333333  0.285714  0.250000  0.222222
C  0.200000  0.181818  0.166667  0.153846  0.142857
D  0.133333  0.125000  0.117647  0.111111  0.105263
E  0.100000  0.095238  0.090909  0.086957  0.083333
F  0.080000  0.076923  0.074074  0.071429  0.068966
G  0.066667  0.064516  0.062500  0.060606  0.058824
H  0.057143  0.055556  0.054054  0.052632  0.051282
I  0.050000  0.048780  0.047619  0.046512  0.045455
J  0.044444  0.043478  0.042553  0.041667  0.040816

In [366]:
# filtering

In [375]:
df

    a   b   c   d   e
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14
D  15  16  17  18  19
E  20  21  22  23  24
F  25  26  27  28  29
G  30  31  32  33  34
H  35  36  37  38  39
I  40  41  42  43  44
J  45  46  47  48  49

In [376]:
df["b"]>5

A    False
B     True
C     True
D     True
E     True
F     True
G     True
H     True
I     True
J     True
Name: b, dtype: bool

In [381]:
df[df["b"]>5]

    a   b   c   d   e
B   5   6   7   8   9
C  10  11  12  13  14
D  15  16  17  18  19
E  20  21  22  23  24
F  25  26  27  28  29
G  30  31  32  33  34
H  35  36  37  38  39
I  40  41  42  43  44
J  45  46  47  48  49

In [382]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [ ]:
Calling DataFrame’s sum method returns a Series containing column sums:

In [383]:
df.sum()

one    9.25
two   -5.80
dtype: float64